{
    "displayName": "CA001: Require multi-factor authentication for admins",
    "state": "enabled",
    "conditions": {
        "applications": {
            "includeApplications": ["All"],
            "excludeApplications": [],
            "includeUserActions": []
        },
        "users": {
            "includeUsers": ["None"],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [],
            "includeRoles": ["d2562ede-74db-457e-a7b6-544e236ebb61",
                "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                "c430b396-e693-46cc-96f3-db01bf8bb62a",
                "58a13ea3-c632-46ae-9ee0-9c0d43cd7f3d",
                "8424c6f0-a189-499e-bbd0-26c1753c96d4",
                "5b784334-f94b-471a-a387-e7219fc49ca2",
                "ecb2c6bf-0ab6-418e-bd87-7986f8d63bbe",
                "c4e39bd9-1100-46d3-8c65-fb160da0071f",
                "25a516ed-2fa0-40ea-a2d0-12923a21473a",
                "0526716b-113d-4c15-b2c8-68e3c22b9f80",
                "e3973bdf-4987-49ae-837a-ba8e231c7286",
                "7495fdc4-34c4-4d15-a289-98788ce399fd",
                "aaf43236-0c0d-4d5f-883a-6955382ac081",
                "3edaf663-341e-4475-9f94-5c398ef6c070",
                "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                "892c5842-a9a6-463a-8041-72aa08ca3cf6",
                "158c047a-c907-4556-b7ef-446551a6b5f7",
                "7698a772-787b-4ac8-901f-60d6b08affd2",
                "17315797-102d-40b4-93e0-432062caca18",
                "e6d1a23a-da11-4be4-9570-befc86d067a7",
                "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                "38a96431-2bdf-4b4c-8b6e-5d3d8abac1a4",
                "8329153b-31d0-4727-b945-745eb3bc5f31",
                "44367163-eba1-44c3-98af-f5787879f96a",
                "963797fb-eb3b-4cde-8ce3-5878b3f32a3f",
                "3f1acade-1e04-4fbc-9b69-f0302cd84aef",
                "29232cdf-9323-42fd-ade2-1d097af3e4de",
                "31392ffb-586c-42d1-9346-e59415a2cc4e",
                "dd13091a-6207-4fc0-82ba-3641e056ab95",
                "6e591065-9bad-43ed-90f3-e9424366d2f0",
                "0f971eea-41eb-4569-a71e-57bb8a3eff1e",
                "be2f45a1-457d-42af-a067-6ec1fa63bc45",
                "a9ea8996-122f-4c74-9520-8edcd192826c",
                "62e90394-69f5-4237-9190-012177145e10",
                "ac434307-12b9-4fa1-a708-88bf58caabc1",
                "fdd7a751-b60b-444a-984c-02652fe8fa1c",
                "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                "8ac3fc64-6eca-42ea-9e69-59f4c7b60eb2",
                "45d8d3c5-c802-45c6-b32a-1d70b5e1e86e",
                "eb1f4a8d-243a-41f0-9fbd-c7cdf6c5ef7c",
                "3a2c62db-5318-420d-8d74-23affee5d9d5",
                "2ea5ce4c-b2d8-4668-bd81-3680bd2d227a",
                "74ef975b-6605-40af-a5d2-b9539d836353",
                "b5a8dcf3-09d5-43a9-a639-8e29ef291470",
                "4d6ac14f-3453-41d0-bef9-a3e0c569773a",
                "59d46f88-662b-457b-bceb-5c3809e5908f",
                "1707125e-0aa2-4d4d-8655-a7c786c76a25",
                "8c8b803f-96e1-4129-9349-20738d9f9652",
                "1501b917-7653-4ff9-a4b5-203eaf33784f",
                "d37c8bed-0711-4417-ba38-b4abe66ce4c2",
                "2b745bdf-0803-4d80-aa65-822c4493daac",
                "92ed04bf-c94a-4b82-9729-b799a7a4c178",
                "966707d0-3269-4727-9be2-8c3a10f19b9d",
                "024906de-61e5-49c8-8572-40335f1e0e10",
                "af78dc32-cf4d-46f9-ba4e-4428526346b5",
                "11648597-926c-4cf3-9c36-bcebb0ba8dcc",
                "644ef478-e28f-4e28-b9dc-3fdde9aa0b1f",
                "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                "e8611ab8-c189-46e8-94e1-60213ab1f814",
                "0964bb5e-9bdb-4d7b-ac29-58e794862a40",
                "194ae4cb-b126-40b2-bd5b-6091b380977d",
                "f023fd81-a637-4b56-95fd-791ac0226033",
                "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                "1a7d78b6-429f-476b-b8eb-35fb715fffd4",
                "75941009-915a-4869-abe7-691bff18279e",
                "69091246-20e8-4a56-aa4d-066075b2a7a8",
                "baf37b3a-610e-45da-9e62-d9d1e5e8914b",
                "3d762c5a-1b6c-493f-843e-55a3b42923d4",
                "aa38014f-0993-46e9-9b45-30501a20909d",
                "fe930be7-5e62-47db-91af-98c3a49a38b1",
                "e300d9e7-4a2b-4295-9eff-f1c78b36cc98",
                "0ec3f692-38d6-4d14-9e69-0377ca7797ad",
                "92b086b3-e367-4ef2-b869-1de128fb986e",
                "11451d60-acb2-45eb-a7d6-43d0f0125c13",
                "32696413-001a-46ae-978c-ce0f6b3620d2",
                "810a2642-a034-447f-a5e8-41beaa378541",
                "9f06204d-73c1-4d4c-880a-6edb90606fd8"],
            "excludeRoles": []
        },
        "platforms": null,
        "locations": null,
        "signInRiskLevels": [],
        "clientAppTypes": [0]
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [1],
        "customAuthenticationFactors": [],
        "termsOfUse": []
    },
    "sessionControls": null
}
