{
    "_wap_tags": "Endpoint Security",
    "description": "Enable the Local Admin Password Solution to store the password for the built-in local administrator account to Entra ID. When expired, the managed admin's user session will be logged off automatically.",
    "name": "NMM Enable Windows LAPS",
    "platforms": "windows10",
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 2,
    "technologies": "mdm",
    "templateReference": {
        "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
        "templateFamily": "endpointSecurityAccountProtection",
        "templateDisplayName": "Local admin password solution (Windows LAPS)",
        "templateDisplayVersion": "Version 1"
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_laps_policies_backupdirectory_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_laps_policies_postauthenticationactions_3",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        }
    ]
}