{
    "_wap_tags": "User Experience",
    "@odata.type": "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "displayName": "NMM Autopilot for Standard Users",
    "description": "Simple deployment profile for userdriven enrollment with Standard User accounts permissions.",
    "language": "os-default",
    "locale": "os-default",
    "enrollmentStatusScreenSettings": null,
    "extractHardwareHash": true,
    "hardwareHashExtractionEnabled": true,
    "deviceNameTemplate": "",
    "deviceType": "windowsPc",
    "enableWhiteGlove": true,
    "preprovisioningAllowed": true,
    "roleScopeTagIds": [
        "0"
    ],
    "managementServiceAppId": null,
    "outOfBoxExperienceSettings": {
        "@odata.type": "#microsoft.graph.outOfBoxExperienceSettings",
        "hidePrivacySettings": true,
        "hideEULA": true,
        "userType": "standard",
        "deviceUsageType": "singleUser",
        "skipKeyboardSelectionPage": false,
        "hideEscapeLink": true
    },
    "outOfBoxExperienceSetting": {
        "@odata.type": "#microsoft.graph.outOfBoxExperienceSetting",
        "privacySettingsHidden": true,
        "eulaHidden": true,
        "userType": "standard",
        "deviceUsageType": "singleUser",
        "keyboardSelectionPageSkipped": false,
        "escapeLinkHidden": true
    }
}