{
    "_wap_tags": "Defender for Endpoint",
    "templateId": "63be6324-e3c9-4c97-948a-e7f4b96f0f20",
    "description": "Sets AppLocker to audit mode for Store apps and SmartLocker, doesn\u0027t block file overrides by SmartScreen, and disables SmartScreen prompts in the shell. This config audits app usage without enforcing restrictions or SmartScreen interventions.",
    "displayName": "NMM Application Control (audit mode)",
    "settings": [
        {
            "@odata.type": "#microsoft.graph.deviceManagementStringSettingInstance",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_appLockerApplicationControl",
            "valueJson": "\"auditComponentsStoreAppsAndSmartlocker\"",
            "value": "auditComponentsStoreAppsAndSmartlocker"
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenBlockOverrideForFiles",
            "valueJson": "false",
            "value": false
        },
        {
            "@odata.type": "#microsoft.graph.deviceManagementBooleanSettingInstance",
            "definitionId": "deviceConfiguration--windows10EndpointProtectionConfiguration_smartScreenEnableInShell",
            "valueJson": "false",
            "value": false
        }
    ]
}