{
    "_wap_tags": "iOS",
    "@odata.type": "#microsoft.graph.iosUpdateConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description": "",
    "displayName": "NMM iOS Update policy",
    "isEnabled": false,
    "activeHoursStart": "00:00:00.0000000",
    "activeHoursEnd": "00:00:00.0000000",
    "desiredOsVersion": null,
    "scheduledInstallDays": [],
    "utcTimeOffsetInMinutes": null,
    "enforcedSoftwareUpdateDelayInDays": null,
    "updateScheduleType": "alwaysUpdate",
    "customUpdateTimeWindows": []
}
