{
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "description": "From the Autopilot ESP, skip the account setup page if you have no user assigned apps to save time during initial deployment. Only device assigned application will be installed.",
    "displayName": "NMM Skip Autopilot account setup page",
    "omaSettings": [
        {
            "@odata.type": "#microsoft.graph.omaSettingBoolean",
            "displayName": "SkipUserStatusPage",
            "description": null,
            "omaUri": "./Device/Vendor/MSFT/DMClient/Provider/MS DM Server/FirstSyncStatus/SkipUserStatusPage",
            "secretReferenceValueId": null,
            "isEncrypted": false,
            "value": true
        }
    ]
}
