{
    "_wap_tags": "Defender for Endpoint",
    "description": "",
    "name": "NMM Defender onboarding for Windows 10/11 autoconnect",
    "platforms": "windows10",
    "settingCount": 2,
    "technologies": "mdm,microsoftSense",
    "templateReference": {
        "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
        "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
        "templateDisplayName": "Endpoint detection and response",
        "templateDisplayVersion": "Version 1"
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651",
                        "useTemplateDefault": false
                    },
                    "children": [
                        {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                            "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
                            "settingInstanceTemplateReference": null,
                            "simpleSettingValue": {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue",
                                "settingValueTemplateReference": null,
                                "value": "Microsoft ATP connector enabled",
                                "valueState": "NotEncrypted"
                            }
                        }
                    ]
                }
            }
        },
        {
            "id": "1",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing",
                "settingInstanceTemplateReference": {
                    "settingInstanceTemplateId": "6998c81e-2814-4f5e-b492-a6159128a97b"
                },
                "choiceSettingValue": {
                    "value": "device_vendor_msft_windowsadvancedthreatprotection_configuration_samplesharing_1",
                    "settingValueTemplateReference": {
                        "settingValueTemplateId": "f72c326c-7c5b-4224-b890-0b9b54522bd9",
                        "useTemplateDefault": false
                    },
                    "children": []
                }
            }
        }
    ]
}