{
    "_wap_tags": "IOS",
    "@odata.type": "#microsoft.graph.iosCompliancePolicy",
    "description": null,
    "displayName": "NMM iOS BYOD Compliancy",
    "version": 3,
    "passcodeBlockSimple": false,
    "passcodeExpirationDays": null,
    "passcodeMinimumLength": null,
    "passcodeMinutesOfInactivityBeforeLock": null,
    "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
    "passcodePreviousPasscodeBlockCount": null,
    "passcodeMinimumCharacterSetCount": null,
    "passcodeRequiredType": "deviceDefault",
    "passcodeRequired": true,
    "osMinimumVersion": null,
    "osMaximumVersion": null,
    "osMinimumBuildVersion": null,
    "osMaximumBuildVersion": null,
    "securityBlockJailbrokenDevices": true,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "managedEmailProfileRequired": false,
    "restrictedApps": [],
    "scheduledActionsForRule": []
}
