{
    "_wap_tags": "Edge",
    "displayName": "NMM Edge automatic sign-in",
    "description": "",
    "definitionValues": [
        {
            "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('43bd9826-a322-4562-ad44-3541e19bdb37')",
            "enabled": true
        },
        {
            "definition@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('b6224bac-9571-4ff9-b478-9337b898bab9')",
            "presentationValues": [
                {
                    "presentation@odata.bind": "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions('b6224bac-9571-4ff9-b478-9337b898bab9')/presentations('aa36fa17-7a02-48c7-bd3a-c4278e671d57')",
                    "value": "2",
                    "@odata.type": "#microsoft.graph.groupPolicyPresentationValueText"
                }
            ],
            "enabled": true
        }
    ]
}
